{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<h1>Финальное задание модуля 1</h1>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "УСЛОВИЯ ЗАДАНИЯ:\n",
    "\n",
    "Компьютер загадывает целое число от 1 до 100, и нам его нужно угадать. Под «угадать» подразумевается «написать программу, которая угадывает число».\n",
    "Алгоритм учитывает информацию о том, больше или меньше случайное число нужного нам числа."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Максимальное количество попыток угадать на 1000 игр: 7\n"
     ]
    }
   ],
   "source": [
    "# импорт библиотеки numpy для работы со случайными числами\n",
    "import numpy as np \n",
    "\n",
    "def guess_the_number(number:int=1) -> int:\n",
    "    ''' Функция, получающая на вход число, а на выходе \n",
    "    выдающая количество попыток его угадать.\n",
    "    Алгоритм функции заключается в сокращении диапазона,\n",
    "    в котором может находится функция, путём сравнения\n",
    "    загаданного числа с числом, находящимся в середине \n",
    "    диапазона '''\n",
    "    \n",
    "    count = 0 # счётчик\n",
    "    min_v = 1 # минимальное значение диапазона\n",
    "    max_v = 101 # максимальное значение диапазона, увеличенное на 1\n",
    "\n",
    "    while True:\n",
    "        count+=1 #увеличение значения счётчика\n",
    "\n",
    "        ''' устанавливаем вариант ответа, как\n",
    "        среднее арифмитическое между началом\n",
    "        и концом диапазона, с отбрасыванием\n",
    "        дробной части. Для чисел, между которыми\n",
    "        только 1 число делается исключение\n",
    "        '''\n",
    "        if (max_v - min_v > 1):\n",
    "            predict = (max_v + min_v)//2\n",
    "        else:\n",
    "            predict = max_v - 1\n",
    "                \n",
    "        if predict == number:\n",
    "            return(count)\n",
    "            break # если число угадано, возвращаем результат и покидаем цикл\n",
    "        elif number > predict:\n",
    "            min_v = predict # если загадонное число больше, нижней границей устанавливаем вариант ответа\n",
    "        else:\n",
    "            max_v = predict # если загаданное число меньше, yстанавливаем верхней границей вариант ответа\n",
    "\n",
    "           \n",
    "list_attempt = [] # создаём пустой список, в который будем собирать варианты возвращаемых данных\n",
    " \n",
    "# цикл который 1000 раз загадывает и угадывает число \n",
    "for i in range(1000):\n",
    "    rand_number = np.random.randint(1,101) # присваиваем случайное значение загаданному числу\n",
    "    list_attempt.append(guess_the_number(rand_number)) # запускаем функцию и добавляем полученное количество попыток в лист\n",
    "\n",
    "# вывод на экран максимального количества попыток из полученного списка\n",
    "print(f'Максимальное количество попыток угадать на 1000 игр: {max(list_attempt)}')  \n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Вывод:<p>\n",
    "Представленное решение обеспечивает угадывание числа от 1 до 100 менее, чем за 7 попыток."
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "2e524f911eaaec76b485fccf9d4dc913ae5f3be4f2f80ba077a4631f36bfb768"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
